app/controllers/rooms_controller.rb

SELECT  "rooms".* FROM "rooms"  WHERE "rooms"."name" = 'myroom' LIMIT 1
---
	def view
		@name = params[:name]
		@room = Room.find_by_name(@name)